{"data":{"markdownRemark":{"html":"<p>A couple of months ago, I decided it was time for a change of direction and left my job at <a href=\"https://northcoders.com/\">Northcoders</a> to pursue programming full time.</p>\n<p>I've had an amazing time there and the decision to leave was not taken lightly. I loved what I was doing and I especially enjoyed getting to work with and watch the progress of so many enthusiastic, smart and inspiring people from so many different backgrounds. </p>\n<p><figure class=\"md-figure\">\n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block;  max-width: 650px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 63.33333333333333%; position: relative; bottom: 0; left: 0; background-image: url('data:image/jpeg;base64,/9j/2wBDABALDA4MChAODQ4SERATGCgaGBYWGDEjJR0oOjM9PDkzODdASFxOQERXRTc4UG1RV19iZ2hnPk1xeXBkeFxlZ2P/2wBDARESEhgVGC8aGi9jQjhCY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2NjY2P/wgARCAANABQDASIAAhEBAxEB/8QAFgABAQEAAAAAAAAAAAAAAAAABAAD/8QAFAEBAAAAAAAAAAAAAAAAAAAAAP/aAAwDAQACEAMQAAABBuTQVIj/xAAdEAABAgcAAAAAAAAAAAAAAAABAAIDEBESISJB/9oACAEBAAEFAgarCAul2A3T/8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAwEBPwE//8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAgEBPwE//8QAGhAAAgIDAAAAAAAAAAAAAAAAAAERMRASIf/aAAgBAQAGPwKGUTrhdLP/xAAcEAACAgMBAQAAAAAAAAAAAAABIQAxEUFxUdH/2gAIAQEAAT8hC0uTOddGrjrHyUCQpgge32EUb+T/2gAMAwEAAgADAAAAECPP/8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAwEBPxA//8QAFBEBAAAAAAAAAAAAAAAAAAAAEP/aAAgBAgEBPxA//8QAHhABAAICAwADAAAAAAAAAAAAAREhADFBUXGBkcH/2gAIAQEAAT8QZRcAtbH17mvOSkwIaK18dYwjtskW8wbKp7xNkUK4JGH1A9l6f3P/2Q=='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"cohort1\"\n        title=\"\"\n        src=\"/static/276469f030cf5b2c49f4193e27b73b6b/41fcb/cohort1.jpg\"\n        srcset=\"/static/276469f030cf5b2c49f4193e27b73b6b/c7440/cohort1.jpg 163w,\n/static/276469f030cf5b2c49f4193e27b73b6b/145fc/cohort1.jpg 325w,\n/static/276469f030cf5b2c49f4193e27b73b6b/41fcb/cohort1.jpg 650w,\n/static/276469f030cf5b2c49f4193e27b73b6b/93ada/cohort1.jpg 975w,\n/static/276469f030cf5b2c49f4193e27b73b6b/54520/cohort1.jpg 1200w\"\n        sizes=\"(max-width: 650px) 100vw, 650px\"\n      />\n    </span>\n  </span>\n  <figcaption>cohort1</figcaption></figure></p>\n<p>Here I am on the first cohort!</p>\n<p>However, in the long run I wanted to develop as a programmer so I thought it was time to move into the software development industry full time. I've had lots of opportunity to work on internal and student-facing projects at Northcoders, but I wanted to get my hands dirty working on something bigger where I'd be stretched and introduced to new technologies.</p>\n<p>I only interviewed at one place in the end. I was planning to interview at a few places and be in a position to choose between offers (hopefully!) and I started off in talks with a few companies, but it turned out that one place I was really excited about turned everything around really quickly. Since interviewing is stressful and I was really excited, I decided to accept their offer right away and stop my other interviews.</p>\n<p>I thought I'd share my interview process, just to give an idea of what it involved for anyone who might be interested.</p>\n<p><strong>CV Application</strong></p>\n<p>I applied with my CV via Northcoders. The great thing about working in a coding bootcamp is the variety of companies we have connections with and how easy it is to leverage that network.</p>\n<p>My CV described some projects I'd been working on, and also linked to my Github where I had some personal apps and projects, but nothing I was especially trying to show off. I didn't have big projects on there as they were private repositories belonging to my organisation, but I did have a big green streak (the amount of commits you are making to repositories) and regular activity. I had recently also been working on some side projects such as <a href='https://github.com/harrietty/hexpress' target='_blank'>reimplementing Express</a> which was available on my Github.</p>\n<p>I also linked to my <a href=\"https://medium.com/@harrietty\">Medium Blog</a>. Neither my blog nor my personal Github projects were mentioned or questioned during the interview so I don't know whether they contributed or not. 🤷</p>\n<p><strong>Online Tech Test</strong></p>\n<p>The first stage was an online tech test. This was to be completed in an hour, in my own time, on an online environment. It was an environment similar to <a href=\"https://www.hackerrank.com\">Hacker Rank</a> which luckily I had used before. If I hadn't used it before it might have confused me for a moment, as it feeds input via Standard In and expects output via Standard Out, rather than having a function to complete and a test suite, which is something I've seen more often before.</p>\n<p>The three challenges started off easy and the last one was unfinishable, at least for me. However, knowing that we regularly set unfinishable challenges at Northcoders and that the aim is to see how you break something large down into smaller pieces and work through it, I didn't let that phase me.</p>\n<p>I reckon I got pretty close, and I was happy with how I'd done. I started by writing comments about how I was going to approach the problem, and then when the time ran out, the comments spoke for themselves about where I would go next with the problem, if I'd had more time. I left myself a little bit of time at the end for tidying and refactoring - which I thought was more important than getting an extra fraction of the problem done.</p>\n<p><strong>Telephone Chat</strong></p>\n<p>The next stage was a telephone chat which lasted around an hour. It was with the CTO, Chief Technical Officer. It was not really a technical talk - in fact it was mostly just about the company, my experience and why I wanted to work there. As he said, it was to make sure we could have a decent conversation and therefore communicate and work together, which is super important.</p>\n<p>I was happy when I was asked why I wanted to work there because I had LOTS to say, and not just awkward, rehearsed stuff. I genuinely had no problem rambling about why I loved the look of this company, and as I was talking I realised that this was probably a really good sign!</p>\n<p><strong>Paid day of work in the office</strong></p>\n<p>This was awesome, although I was quite nervous. I have heard of companies doing this but never experienced it first hand. Given the cost of making a hiring mistake, I think it's a brilliant idea and I think more companies should embrace it. Seems like a lot of effort in the short term, but in the long term it's a great way for both parties to really see how you work and how you fit within the team. And it probably saves a lot of those first day nerves and awkwardness too.</p>\n<p>I'd been given a brief about the tasks I'd be doing on the day, and told that I didn't need to prepare in any way, and I tried to be strict with myself about that. </p>\n<p>I read the document and made some notes but I deliberately didn't Google anything or dig too deep into it because I wanted to be able to ask natural questions on the day and interact with the team in a natural way. I didn't want to turn up with the idea that I knew exactly what I was going to be doing and then not ask questions. I wanted to discover problems organically and have reasons to ask for help if I needed it.</p>\n<p>It was great to meet the team, do a sample commute, and feel the vibe of the office. Working on a genuine problem for a day (on a special \"safe\" version of the code base) confirmed the fact that I would enjoy the day to day work. I also got lots of opportunities to chat to people, find out more about the product and what the company was going to look like in the short and long term.</p>\n<p><strong>Offer</strong></p>\n<p>So then the final stage - an offer! Which of course I accepted since I was super excited.</p>","frontmatter":{"title":"Interviewing for a Software Engineer role","date":"1st Mar, 2018","tags":["careers","job-hunting","softwaredevelopment"],"description":null}}},"pageContext":{"slug":"/blog/interviewing-for-software-engineer/"}}