{"data":{"markdownRemark":{"html":"<h4>The background</h4>\n<p>Have you ever wondered how sites like <a href=\"http://codewars.com/\">Codewars</a> and <a href=\"https://www.hackerrank.com/\">Hackerrank</a> work behind the scenes? You write some code in the browser, generally in a box that's styled to look like a terminal or a text editor, press a button and are then displayed the results of running your code through a number of tests.</p>\n<p>\n  <span\n    class=\"gatsby-resp-image-wrapper\"\n    style=\"position: relative; display: block; ; max-width: 650px; margin-left: auto; margin-right: auto;\"\n  >\n    <span\n      class=\"gatsby-resp-image-background-image\"\n      style=\"padding-bottom: 49.008498583569406%; position: relative; bottom: 0; left: 0; background-image: url('data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAABQAAAAKCAYAAAC0VX7mAAAACXBIWXMAABYlAAAWJQFJUiTwAAABEElEQVQoz62R207CQBCG9xVoF0wwtva4LfREjxiNIoh4wArxDoj3xPe//u1uMUjiRU168WVmZ3a+nWTJ9c0tgnCEwdBHXlwhjGJk+biigOeHopdmBZI0x37/he3uE88vS8HrskT5vsbj4glv5QpxkoHwy3xo6AWiwPNRnAoBF/pBhGiUiN5ms8Nq/YHpbI7J/UzEh/kCd5OpiHyO5MVYbGcxF5btwmZHmDMQ/OSGacO0WIVT3a3hZ97nD/NliGFYcJkNZmpwLB2aruNCUQ8oB+pcUdVfvVMuNU1ISa93hn7/HJTK6HYpZEohyXJjZHrMPT8A6UjSH5Ja3JRaTMU/VMLOv4YbCKWTYmvC1jdsS/gN0poSA5MOsiYAAAAASUVORK5CYII='); background-size: cover; display: block;\"\n    >\n      <img\n        class=\"gatsby-resp-image-image\"\n        style=\"width: 100%; height: 100%; margin: 0; vertical-align: middle; position: absolute; top: 0; left: 0; box-shadow: inset 0px 0px 0px 400px white;\"\n        alt=\"The CodeWars interface\"\n        title=\"\"\n        src=\"/static/codewars-da27e0a03274039b73c6a5dc00cf5271-0996b.png\"\n        srcset=\"/static/codewars-da27e0a03274039b73c6a5dc00cf5271-fa718.png 163w,\n/static/codewars-da27e0a03274039b73c6a5dc00cf5271-1ce8d.png 325w,\n/static/codewars-da27e0a03274039b73c6a5dc00cf5271-0996b.png 650w,\n/static/codewars-da27e0a03274039b73c6a5dc00cf5271-bf376.png 975w,\n/static/codewars-da27e0a03274039b73c6a5dc00cf5271-021cf.png 1300w,\n/static/codewars-da27e0a03274039b73c6a5dc00cf5271-ac284.png 1412w\"\n        sizes=\"(max-width: 650px) 100vw, 650px\"\n      />\n    </span>\n  </span>\n  </p>\n<p>These sites are not executing your code in the browser - they are sending it to their own servers to execute. Firstly, browsers only contain JavaScript runtimes, so they wouldn't be able to interpret code in languages such as Ruby or Python. And you;d only have access the the browser evironment, so no Node or anything like that. Secondly, there would be a lot of risk of the user ending up doing something weird and breaking the site they were trying to interact with, or even crashing the whole browser. It wouldn't be a security risk, since users can already execute JavaScript on any page they like by going to the console and running it themselves, but limitations and poor user experience already make it a big enough no-go.</p>\n<p>The solution that these sorts of sites come up with is to devise a secure environment on the back-end to run the user's code. There are lots of articles about this topic, and many of them mention Docker as a solution to providing this secure environment. Prior to Docker, virtual machines such as VirtualBox may have been used, or companies may have implemented their own \"sandboxes\" (which CodeWars allude to in <a href=\"https://medium.com/@Codewars/next-gen-code-execution-engine-is-live-5a6692bb6d2e\">this article</a>), a sandbox being a secure(ish) environment that exposes enough of a programming language's features to be usable, but not enough for the user to do any harm to the system. However, CodeWars admit that their early sandbox was hackable, which sounds about right. I certainly wouldn't like the responsibility of attempting to build a completely secure sandbox for user submitted code. In short, thank the lord for Docker.</p>\n<h4>What I wanted to achieve</h4>\n<p>I wanted to learn how hard it would be to replicate the basic components of a system that receives user input and executes a test suite for this code in a Docker container, reporting back to the server and then to the user on how whether their code passed the tests.</p>\n<p>I was particularly interested in running <em>shell scripts</em>, becasue I have been frustrated recently at the lack of online exercises to practice shell scripting that actually make use of Bash to its full advantage. You can solve problems in Bash on CodeWars, but these tend to be problems that were actually designed for other programming languages. As such, you aren't solving real-world problems that you would actually <em>choose</em> Bash to solve.</p>\n<p>For example, Bash is a poor choice for arithmetic and number manipulation, but it can do extremely powerful manipulation of large text files. It would be great if there were exercises out there that asked you to manipulate or search log files, or generally do the sorts of things you'd actually do with Bash. This would involve not only running a test suite for the user's code, but providing an environment in which those log files existed.</p>","frontmatter":{"title":"Running user-submitted code in a Docker sandbox","date":"17th Nov, 2018","tags":["code","howto","technical","tutorial"],"description":null}}},"pageContext":{"slug":"/blog/running-code-docker-sandbox/"}}