{"data":{"markdownRemark":{"html":"<p>The whole process of joining Northcoders happened in a bit of a flurry in mid-February. I had been scouting out bootcamps for a little while and had my eye on perhaps joining a remote coding bootcamp, which was about all I could afford at that time. Then I came across <a href=\"https://northcoders.com/\">Northcoders</a>, which looked quite new, and because I couldn't see their fees on their website, sent them a tweet.</p>\n<p>Before I knew it, they'd suggested I check out their Women in Tech scholarships and I decided to apply, because why not? I didn't think I'd get one, but it seemed like too good an opportunity to miss. I really had no idea whether I was the sort of person they were looking for or whether my odd bits of JavaScript work would pass muster but to my amazement they seemed really positive about my application and invited me to an interview.</p>\n<p>I'm the kind of person who likes to be prepared. I'll usually hold off putting myself out there until I've amassed a nice big pile of watermarked pieces of paper and can go along proudly to an interview and convince people with some honesty that I know what I'm doing in this world. (See: <a href=\"https://hbr.org/2014/08/why-women-dont-apply-for-jobs-unless-theyre-100-qualified\">Why Women Don't Apply for Jobs Unless They're 100% Qualified</a> ) If possible, I'll even make a practice run to the destination so terrible sat-navvy things can't happen. There is no way I would have considered myself ready to join an intensive bootcamp if Northcoders hadn't been so positive about my initial application. If I'd had it my way, I would have waited about 6 months, made sure I really knew as much JavaScript as possible (Northcoders is a JS-based bootcamp), and then would have applied. With only a week to prepare before my interview and a full-time job to do at the same time, I didn't get anywhere near as much practice as I would have liked, and managed only to refresh the <a href=\"https://www.codecademy.com/learn/javascript\">Code Academy JavaScript course</a> and spend some time on <a href=\"http://www.codewars.com/\">Code Wars</a>. But it was actually great that I was swept along with the flow of things faster than I would have moved myself, and it showed me that by undervaluing my own abilities I was just wasting time, not doing myself any favours.</p>\n<p>I went to the day thinking, well, I'm sure I'm not good enough, but at least this will give me some idea of how much I need to improve for next time. After a brief chat and a look at some of the small projects I'd created with HTML/CSS/JavaScript (quizzes, calculators, etc.) we dived into the coding challenge and that took up most of the time.</p>\n<p>I won't discuss what exactly the test was - but the logic felt pretty complex (for me) and at points I felt like I didn't know what I was doing and was just guessing what would work. I felt increasingly disappointed in myself as the challenge went on and thought I was doing really badly, but James and Chris actually said I'd done well once I got it working. Thinking about it, I guess maybe what they'd really been looking for was not whether I knew the solution immediately, because that was hard, but how I'd think about getting there and whether I knew my basics. Maybe they also wanted to see how I behaved when I struggled or thought I couldn't do something -  I don't know. At the time I was just so amazed to be offered a scholarship that I promptly put all worries to the back of my mind and went out to buy a new pair of shoes to celebrate. Later, I began to think about the challenge some more and slowly the logic began to make sense. I could see clearly what I hadn't been able to see in the heat of the moment and wished I could have taken a step back to pause and look more carefully at the problem instead of rushing through, worrying about taking too long.</p>\n<p>If you are going for an interview for a bootcamp, I would recommend brushing up your skills as much as possible -  because why wouldn't you be doing that anyway? - but perhaps more importantly, remember you're not supposed to know everything. You can trust that your interviewers know what they're looking for and how to test for it, and you can be sure they are using the coding challenge as a way of testing more than simply whether you know the answer to X problem. This is their chance to see how you work, how you respond to challenges, how you find help, what you do when stuff doesn't work, what questions you ask. They definitely want to see you succeed and not give up, even if it takes a while, and a bit of googling!</p>","frontmatter":{"title":"Joining Northcoders - The Interview Process","date":"17th Mar, 2016","tags":["northcoders","coding","bootcamp","learning"],"description":null}}},"pageContext":{"slug":"/blog/northcoders-interview-process/"}}